### Problem 1

In [1]:
import pandas as pd

In [2]:
authors = pd.DataFrame({
    "author_id":[1, 2, 3],
    "author_name":['Тургенев', 'Чехов', 'Островский']
})

In [3]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [4]:
books = pd.DataFrame({
    "author_id": [1, 1, 1, 2, 2, 3, 3],
    "book_title": ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    "price": [450, 300, 350, 500, 450, 370, 290]
})

In [5]:
books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

### Problem 2

In [6]:
authors_price = pd.merge(authors, books, on = 'author_id', how = 'right')

In [7]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

### Problem 3

In [8]:
top = authors_price.sort_values(by='price', ascending = False)

In [9]:
top5= top[:5]

In [10]:
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

### Problem 4

In [11]:
authors_ = authors_price.groupby("author_name")

In [12]:
min_p = authors_["price"].min()

In [13]:
max_p = authors_["price"].max()

In [14]:
mean_p = authors_["price"].mean()
mean_p

author_name
Островский    330.000000
Тургенев      366.666667
Чехов         475.000000
Name: price, dtype: float64

In [15]:
authors_price_merged = pd.merge(min_p, max_p,on = 'author_name', how = 'right')
authors_price_merged

             price_x  price_y
author_name
Островский       290      370
Тургенев         300      450
Чехов            450      500

In [16]:
authors_stat = pd.merge(authors_price_merged,mean_p ,on = 'author_name', how = 'right')
authors_stat.rename(columns={'price_x': 'min_price','price_y': 'max_price', 'price': 'mean_price'},  inplace=True)
authors_stat

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000